export const vacancies = [
    {
        id: 1,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 3 лет',
        work_format: 'Гибрид',
        location: 'Москва',
        title: 'Разработчик в команду рендеринга Карт',
        short_description: `Мы ищем разработчика, который поможет создавать Яндекс Карты нового поколения c высокой детализацией. Вам предстоит писать код для поддержки нескольких картографических форматов. Ждём, что вы знаете основы линейной алгебры и геометрии, владеете TypeScript или готовы его освоить.`,
        description: `Наша команда занимается задачами, связанными с рендерингом карт. Прямо сейчас мы создаём Яндекс Карты нового поколения c высокой детализацией и большим количеством 3D-объектов.

Новое поколение Яндекс Карт: как изменится цифровой город

Новое поколение Яндекс Карт: как изменится цифровой город

Что вас ждёт

Какие задачи вас ждут

Мы ждём, что вы

Будет плюсом, если вы

Здоровье

Расширенная медицинская страховка начинает работать с первого месяца в Яндексе. В неё входят стоматология, ежегодные чекапы, неотложная помощь за рубежом, лечение критических заболеваний, в том числе онкологии, и страхование от несчастных случаев.

А также:
  - психотерапия в офисе или онлайн-сервисах;
  - лазерная коррекция зрения через год работы;
  - ведение беременности и роды — через два года.

Страховка для родственников по системе 80/20
  - Мы оплачиваем 80% стоимости ДМС для детей и супругов, вы — остальные 20%.

Рост и развитие

В Яндексе есть всё, чтобы постоянно развиваться и учиться новому: внутренняя образовательная платформа, менторство и программы для начинающих и опытных руководителей.

А также:
  - тренинги и курсы повышения квалификации;
  - возможность работать над интересными и сложными проектами;
  - участие в конференциях и хакатонах.

Спорт

В компании действует программа корпоративного фитнеса.

Также можно заниматься спортом в спортзале, который находится прямо в офисе.

И ещё

Дополнительные льготы и привилегии для сотрудников.

Возможность работать удалённо.

Развитая инфраструктура для комфортного проживания в офисе.`,
    },
    {
        id: 2,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 5 лет',
        work_format: 'Офис',
        location: 'Москва',
        title: 'Разработчик интерфейсов в Еду',
        short_description: `Яндекс Еда помогает ресторанам и кафе доставлять заказы клиентам. Ищем фронтенд-разработчика, который будет создавать интерфейсы для пользователей, управлять метриками качества и поддерживать архитектуру сервиса. Ждём, что вы отлично владеете React, JavaScript и TypeScript.`,
        description: `Яндекс Еда помогает ресторанам и кафе доставлять заказы клиентам. Ищем фронтенд-разработчика, который будет создавать интерфейсы для пользователей, управлять метриками качества и поддерживать архитектуру сервиса. Ждём, что вы отлично владеете React, JavaScript и TypeScript.`,
    },
    {
        id: 3,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 7 лет',
        work_format: 'Гибрид',
        location: 'Москва',
        title: 'Разработчик интерфейсов в геосервисы автономного транспорта',
        short_description: `Нам нужен разработчик интерфейсов, который будет создавать новые сервисы, развивать существующие и отвечать за часть их функциональности. Вам предстоит решать интересные задачи, разрабатывать архитектуру и код сервисов и доводить их до продакшна.`,

        description: `Команда разработки геосервисов автономного транспорта создаёт высокоточные карты для флота автономных автомобилей и роботов. Мы разрабатываем редактор векторной карты, сервисы для работы с лидарной картой, алгоритмы создания карт, ПО для чтения карт на устройствах. А ещё поставляем карты другим сервисам автономного транспорта и помогаем с внутренними процессами разработки карты.
Нам нужен разработчик интерфейсов, который будет создавать новые сервисы, развивать существующие и отвечать за часть их функциональности. Вам предстоит решать интересные задачи, разрабатывать архитектуру и код сервисов и доводить их до продакшна.`,
    },
    {
        id: 4,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 5 лет',
        work_format: 'Ремоут',
        location: 'Москва',
        title: 'Менеджер по продуктам',
        short_description: `Мы ищем разработчика, который поможет создавать Яндекс Карты нового поколения c высокой детализацией. Вам предстоит писать код для поддержки нескольких картографических форматов. Ждём, что вы знаете основы линейной алгебры и геометрии, владеете TypeScript или готовы его освоить.`,

        description: `Amazon ищет менеджера по продуктам, который будет разрабатывать и внедрять новые продукты и услуги. Ждём...`,
    },
    {
        id: 5,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 3 лет',
        work_format: 'Ремоут',
        location: 'Москва',
        title: 'Разработчик интерфейсов в финансовые продукты HR Tech',
        short_description: `Сейчас мы ищем разработчика интерфейсов в команду компенсаций и бюджетирования. К этому направлению относятся вопросы материальной и не только мотивации сотрудников и учёта её стоимости. В зоне ответственности команды находятся два десятка микросервисов, есть сформировавшийся стек технологий и коллектив опытных специалистов.`,

        description: 'Подразделение HR Tech разрабатывает, поддерживает и развивает внутренние сервисы Яндекса. Мы отвечаем за десятки важных систем, необходимых для работы компании. Наши пользователи — все сотрудники Яндекса. У этого есть свои классные особенности: например, можно прямо пообщаться с пользователем и быстро получить актуальный фидбэк. Мы активно растём и развиваемся вместе с компанией, задач перед нами с каждым годом встаёт всё больше, и они становятся смелее и сложнее.\n' +
            'Сейчас мы ищем разработчика интерфейсов в команду компенсаций и бюджетирования. К этому направлению относятся вопросы материальной и не только мотивации сотрудников и учёта её стоимости. В зоне ответственности команды находятся два десятка микросервисов, есть сформировавшийся стек технологий и коллектив опытных специалистов.\n' +
            '\n' +
            'Какие задачи вас ждут\n' +
            'Настраивать и развивать инфраструктуру для разработки и деплоя фронтовых приложений\n' +
            'Наши фронтендеры сами настраивают свою инфраструктуру так, чтобы она работала наилучшим образом: быстро и эффективно. Знаете, как ускорить сборку релиза и его доставку в прод? А может, хотите в этом разобраться? Давайте делать это вместе!\n' +
            'Поддерживать технологии актуальными\n' +
            'Никто не любит копаться в легаси. Вот и мы тоже. Поэтому мы стараемся выстраивать процессы так, чтобы технологии не устаревали, помогали развиваться проекту и сотрудникам. Это не всегда просто — но полезно и увлекательно.\n' +
            '\n' +
            'Проектировать, анализировать, оптимизировать приложения, улучшая их каждый день\n' +
            'Мы делаем внутренние сервисы разных масштабов, поэтому сталкиваемся с разными задачами. Это позволяет каждому проявить себя в области, которая его больше всего привлекает. Например, иногда нужно разобраться, почему приложение потеряло былую лёгкость, или научиться рендерить огромные массивы информации без задержек, или спроектировать систему, которую легко развивать и масштабировать.\n' +
            '\n' +
            'Мы ждем, что вы\n' +
            'Владеете технологиями JS, React, Redux (как плюс — TypeScript)\n' +
            'Понимаете webpack\n' +
            'Технически грамотны\n' +
            'Пишете эффективный и понятный код\n' +
            'Способны и готовы объяснять свои решения, договариваться с коллегами\n' +
            'Самостоятельны\n' +
            'Готовы работать в команде\n' +
            'Увлечены своей работой и хотите влиять на общий результат, чтобы делать пользователей счастливее, а не просто закрывать задачи',
    },
    {
        id: 6,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 5 лет',
        work_format: 'Офис',
        location: 'Москва',
        title: 'Разработчик интерфейсов в буткемп Поиска',
        short_description: `Поиск — ведущая поисковая система России и лидер на рынке онлайн-рекламы, один из важнейших бизнесов Яндекса. Менеджеры, дизайнеры, разработчики, тестировщики работают над интерфейсами в небольших самостоятельных командах, чтобы реализовать определённые пользовательские сценарии Поиска`,

        description: `Поиск — ведущая поисковая система России и лидер на рынке онлайн-рекламы, один из важнейших бизнесов Яндекса. Менеджеры, дизайнеры, разработчики, тестировщики работают над интерфейсами в небольших самостоятельных командах, чтобы реализовать определённые пользовательские сценарии Поиска.
Мы не понаслышке знаем, как сложно бывает выбрать продукт и людей, с которыми хочется работать. Буткемп поисковых интерфейсов — отличная возможность провести «тест-драйв» и поработать в нескольких командах. Ищем разработчика, который будет улучшать поисковую систему и создавать интерфейсы для клиентов Поиска.

Какие задачи вас ждут
Проекты на TypeScript/JavaScript + React
Монорепозиторий с общей дизайн-системой
Поддержка только современных браузеров Chromium 66+, Firefox 61+, Safari 12+
Быстрый и надёжный конвейер (автотесты, беты для PR)
Возможность локальной и удалённой разработки на мощных виртуалках
Удобная инфраструктура для написания автотестов (unit, Storybook, скриншотами)
Автоматические релизы дважды в день
Ваша первая фича будет в продакшене уже через несколько дней
Большая распределённая команда с экспертами в различных областях (скорость, инфраструктура, доступность и т. д.)
Мы ждем, что вы
Работали с терминалом
Отлично владеете TypeScript или JavaScript
Хорошо знаете вёрстку
Умеете работать с системами контроля версий
Что мы предлагаем
Высокий совокупный доход и премии каждые полгода по результатам ревью
Ипотечные программы без процентов на 3 года и под 3% на 10 лет
Компенсацию питания
Расширенную программу ДМС: оплату 80% стоимости ДМС для супругов и детей
Спортзал, тренажёрный зал, занятия йогой в офисе
Гибкий график работы`,
    },
    {
        id: 7,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 3 лет',
        work_format: 'Офис',
        location: 'Москва',
        title: 'Разработчик фронтенда в группе разработки интерфейсов платформы управления данными',
        short_description: `Платформа управления данными (DMP) создана для непрерывного повышения эффективности управления данными в компании. Она собирает данные из различных источников, загружает и обрабатывает их в аналитических базах. Платформа также выполняет аналитические расчёты, подготовку данных и их экспорт, контроль качества.
`,

        description: `Платформа управления данными (DMP) создана для непрерывного повышения эффективности управления данными в компании. Она собирает данные из различных источников, загружает и обрабатывает их в аналитических базах. Платформа также выполняет аналитические расчёты, подготовку данных и их экспорт, контроль качества.
Наша команда создаёт веб-интерфейсы для платформы, которые позволяют следить за состоянием процессов и метаинформацией. Больше не нужно получать эту информацию напрямую из базы данных и управлять процессами из кода. Мы представляем данные в таблицах разного масштаба, используем графики для визуализации данных и строим графы. Также мы фокусируемся на инфраструктуре нашего фронтенда: внедряем, поддерживаем и развиваем общие решения, чтобы обеспечить принятый подход к разработке и поддерживать единый стиль кода.

Какие задачи вас ждут
Активное сотрудничество в кросс-функциональной команде
Наша работа не заканчивается разработкой фронтенда. Перед началом реализации новая идея должна пройти через продакт-менеджера и проработку совместно с бэкендом. Этот процесс редко завершается одной встречей: мы тщательно обдумываем архитектуру, визуальное оформление и комплексно прорабатываем выявленные аспекты. Важной частью является наше тесное взаимодействие с пользователями — коллегами, которые могут находиться совсем рядом и давать оперативную обратную связь.
Развитие и поддержка проекта DMP
Мы создаём веб-интерфейс платформы, который удовлетворяет потребности пользователей. Особое внимание уделяется разработке и поддержке инструментов, используемых коллегами ежедневно: мониторинг состояния сущностей через графики и дашборды, запуск и остановка процессов через пользовательские формы и многое другое. Постоянно обдумываем, чего не хватает в отображаемой информации, и расширяем её: дополняем существующие разделы или добавляем новые, от простой визуализации таблиц до полноценного конструктора графов.

Развитие и поддержка проекта Greenplum
Greenplum — это место для сложных расчётов и аналитики. Мы строим вокруг неё собственный веб-интерфейс, развивая его параллельно с DMP. Он отвечает за отображение текущего состояния кластера и принадлежность запросов пользователям. Это позволяет быстро определить запросы, создающие наибольшую нагрузку на кластер и ухудшающие эффективность выполнения других запросов. Векторы разработки схожи с DMP, но акцент делается на визуализацию метаинформации.

Мы ждем, что вы
Имеете опыт работы во фронтенде не менее трёх лет
Уверенно владеете JavaScript и TypeScript с глубоким пониманием их основ
Знаете и уверенно используете React
Готовы решать комплексные задачи, включая взаимодействие с менеджерами и другими командами
Будет плюсом, если вы
Обладаете чувством прекрасного и можете предложить улучшения UI/UX
Работали с CI/CD`,
    },
    {
        id: 8,
        company_name: 'Яндекс',
        companyLogo: '',
        work_experience: 'от 5 лет',
        work_format: 'Ремоут',
        location: 'Москва',
        title: 'Разработчик интерфейсов в Яндекс Образование',
        short_description: `Наша команда создаёт образовательную платформу, основанную на микросервисах. По мере развития платформа будет заменять разрозненные части различных LMS унифицированными, не теряя при этом в функциональности. Платформу будут использовать Учебник, Практикум, Лицей, ШАД и сезонные школы — продукты без единых технических точек соприкосновения. Поэтому понадобится реализовывать одно и то же в разных местах и разными способами.`,

        description: `Наша команда создаёт образовательную платформу, основанную на микросервисах. По мере развития платформа будет заменять разрозненные части различных LMS унифицированными, не теряя при этом в функциональности. Платформу будут использовать Учебник, Практикум, Лицей, ШАД и сезонные школы — продукты без единых технических точек соприкосновения. Поэтому понадобится реализовывать одно и то же в разных местах и разными способами.

Какие задачи вас ждут
Развитие образовательной платформы
Вам предстоит переосмысливать и реализовывать унифицированную техническую составляющую образовательного процесса, проектировать и внедрять микросервисы, применяя паттерны распределённых систем.
Интеграция решений в образовательные продукты
Вы будете развивать платформу с учётом особенностей существующих и будущих пользователей, разбираться в решениях и подходах, находить способы улучшений и интеграций с заменой.

Взаимодействие с кросс-функциональной командой
Необходимо управлять рабочими группами по отведённым проектам, развивать инфраструктуру, инструменты разработки и процессы.

Мы ждем, что вы
Хорошо владеете Vanilla JavaScript или TypeScript, HTML, CSS и React (и экосистемами поверх)
Занимались кросс-браузерной разработкой и не боитесь легаси-кода
Ориентируетесь в классических алгоритмах и структурах данных
Способны аргументировать свою позицию и договариваться с коллегами
Будет плюсом, если вы
Разрабатывали или использовали LMS
Работали с микрофронтендами
Как и мы, болеете за образование
Умеете применять DevOps-практики
Что мы предлагаем`,
    }
];